In [31]:
# importamos la pandas para poder trabajar en la lección
import pandas as pd
import numpy as np

¿Qué diferencia hay entre una Serie y un DataFrame?

una serie es unidimensional (solo una columna, similar a una lista) y el dataframe bidimensional(similar a una tabla)


Momento de trabajar con Series. Contesta a las siguientes preguntas:

Crea dos listas:

Una que se llame "valores" que tenga 7 números aleatorios.

Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

In [8]:
Valores = [5,2,7,6,1,12,10]
Indices = ['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado','domingo']

# A partir de estas dos listas crea una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los índices de la Serie.

serie = pd.Series(Valores, index = Indices)

serie

lunes         5
martes        2
miercoles     7
jueves        6
viernes       1
sabado       12
domingo      10
dtype: int64

In [20]:
# A partir de las dos listas anteriores crea un diccionario usando un bucle for. Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez. Más informción sobre este método aquí.
Diccionario = {}

for i, v in zip(Indices,Valores):
    Diccionario[i] = v


Diccionario

{'lunes': 5,
 'martes': 2,
 'miercoles': 7,
 'jueves': 6,
 'viernes': 1,
 'sabado': 12,
 'domingo': 10}

In [23]:
# Crea una Serie con el diccionario creado en el punto anterior.

serie2 = pd.Series(Diccionario)

print(serie2)

print('--------------------------------------------')

forma = serie2.shape
print(forma)

print('--------------------------------------------')

tipo = serie2.dtype

print(tipo)

print('--------------------------------------------')

size = serie2.size
print(size)

print('--------------------------------------------')

indice = serie2.index
print(indice)

print('--------------------------------------------')

valores = serie2.values
print(valores)

lunes         5
martes        2
miercoles     7
jueves        6
viernes       1
sabado       12
domingo      10
dtype: int64
--------------------------------------------
(7,)
--------------------------------------------
int64
--------------------------------------------
7
--------------------------------------------
Index(['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado',
       'domingo'],
      dtype='object')
--------------------------------------------
[ 5  2  7  6  1 12 10]

In [24]:
# Extrae el valor para el índice "lunes"

lunes = serie2['lunes']

lunes

5

In [29]:
# Extrae el valor para el índice "lunes", "martes" y "miércoles".

lmm = serie2[['lunes','martes','miercoles']]
lmm

lunes        5
martes       2
miercoles    7
dtype: int64

In [30]:
# Extrae el valor para el índice "lunes" y "domingo".

lmm = serie2[['lunes','domingo']]
lmm

lunes       5
domingo    10
dtype: int64


Es el turno de los DataFrames

Crea un array de dos dimensiones con 4 filas y 3 columnas.

Convierte el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

Descarga el archivo "medallas" y carga el DataFrame.

Usando el loc extrae todas las columnas de la fila de Tailandia.

Usando el loc extrae todas las columnas de China e Irán.

Usando el loc extrae solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

Usando el iloc extrae la información de la India. Devolved todas las columnas.

Usando el iloc extrae todas las columnas de los paises que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.

Utilizando el código del ejercicio anterior, selecciona unicamente las columnas "Oro", "Plata" y "Bronce".

Contesta a las siguientes preguntas:

¿Qué país consiguió más de 200 medallas de oro?

¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

Crea una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

In [34]:
# Crea un array de dos dimensiones con 4 filas y 3 columnas.

arrayb = np.random.randint(0, 50, (4,3))
arrayb

array([[20, 17, 33],
       [33, 16, 21],
       [22, 34, 23],
       [28, 49, 39]])

In [35]:
# Convierte el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

df = pd.DataFrame(arrayb, columns= ['españa', 'francia', 'italia'])

df

   españa  francia  italia
0      20       17      33
1      33       16      21
2      22       34      23
3      28       49      39

In [36]:
# Descarga el archivo "medallas" y carga el DataFrame.

df_medallas = pd.read_csv('medallas.csv')
df_medallas

   Unnamed: 0             País   Oro  Plata  Bronce
0           1            China  1473    994     720
1           2            Japón  1032   1037     985
2           3    Corea del Sur   745    663     827
3           4             Irán   179    181     197
4           5       Kazajistán   155    158     224
5           6            India   154    202     315
6           7        Tailandia   132    175     278
7           8        Indonesia   112    131     240
8           9     China Taipéi    99    144     276
9          10  Corea del Norte    91    120     235

In [43]:
# Usando el loc extrae todas las columnas de la fila de Tailandia.

resultado = df_medallas.loc[6,]
resultado

Unnamed: 0            7
País          Tailandia
Oro                 132
Plata               175
Bronce              278
Name: 6, dtype: object

In [44]:
# Usando el loc extrae todas las columnas de China e Irán.

resultado2 = df_medallas.loc[[0,3],]

resultado2

   Unnamed: 0   País   Oro  Plata  Bronce
0           1  China  1473    994     720
3           4   Irán   179    181     197

In [45]:
# Usando el loc extrae solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

resultado3 = df_medallas.loc[[0,3],['Oro', 'Plata', 'Bronce']]

resultado3

    Oro  Plata  Bronce
0  1473    994     720
3   179    181     197

In [46]:
# Usando el iloc extrae la información de la India. Devolved todas las columnas.

resultado3 = df_medallas.iloc[5,]

resultado3

Unnamed: 0        6
País          India
Oro             154
Plata           202
Bronce          315
Name: 5, dtype: object

In [47]:
# Usando el iloc extrae todas las columnas de los paises que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.



resultado3 = df_medallas.iloc[1::2,]

resultado3

   Unnamed: 0             País   Oro  Plata  Bronce
1           2            Japón  1032   1037     985
3           4             Irán   179    181     197
5           6            India   154    202     315
7           8        Indonesia   112    131     240
9          10  Corea del Norte    91    120     235

In [48]:
# Utilizando el código del ejercicio anterior, selecciona unicamente las columnas "Oro", "Plata" y "Bronce".

resultado3 = df_medallas.iloc[1::2,[2,3,4]]

resultado3

    Oro  Plata  Bronce
1  1032   1037     985
3   179    181     197
5   154    202     315
7   112    131     240
9    91    120     235

In [55]:
#Contesta a las siguientes preguntas:

#¿Qué país consiguió más de 200 medallas de oro?

nummedallas = df_medallas[df_medallas['Oro'] > 200]

nummedallas

#¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

nummedallas2 = df_medallas[(df_medallas['Oro'] > 200) & (df_medallas['Plata'] > 1000)]

nummedallas2

#¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

#Crea una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

   Unnamed: 0   País   Oro  Plata  Bronce
1           2  Japón  1032   1037     985